artillery.yml
config:
  target: 'http://127.0.0.1:8081'
  phases:
    - duration: 60
      arrivalRate: 20
    - duration: 120
      arrivalRate: 5
      rampTo: 50
    - duration: 600
      arrivalRate: 100
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/product/80"
    - get: 
        url: "/product/80828"
    - get: 
        url: "/product/5789271"